#pragma once

#include "interface/IElement.h"
#include "../utils/utils.h"


namespace simpleapi {
namespace tools {

class ElementString : public IElement {
protected:
    std::string m_value;

public:
    ElementString()                                 noexcept : m_value()                { init(); }
    explicit ElementString(const std::string& s)    noexcept : m_value(s)               { init(); }
    explicit ElementString(std::string&& s)         noexcept;
    ~ElementString()                                noexcept                            {}

    // Setters =========================================================================================================
private:
    void            init()                                  noexcept                    { m_type = ValueType::eString; }
public:
    // ========================================================================================================= Setters

    // Getters =========================================================================================================
    std::string&    getValue()                                                          { return m_value; }
    std::string     getValue()                              const                       { return m_value; }
    // ========================================================================================================= Getters

    // Modify ==========================================================================================================
    void            clear()                                 noexcept        override;
    // ========================================================================================================== Modify

    // Info ============================================================================================================
    //длина в видимых символах
    bool            isEqual(const IElement &other, const bool compare_comments,
                            const bool map_sort_important)  const noexcept  override;
    size_t          size()                                  const noexcept  override    { return utils::GetStringCharCount(m_value); }
    // ============================================================================================================ Info

    // Operators =======================================================================================================
    // ======================================================================================================= Operators

    // String ==========================================================================================================
    std::string     toString()                              const noexcept  override    { return m_value; }
    // ========================================================================================================== String

    // File ============================================================================================================
    // ============================================================================================================ File

    // Parser ==========================================================================================================
    // ========================================================================================================== Parser

    // Iterators =======================================================================================================
    // ======================================================================================================= Iterators
};

bool IsElementString(const IElement& e)                 noexcept;
bool IsElementString(const Config& cfg)                 noexcept;

} // namespace tools
} // namespace simpleapi
