#ifndef I_ELEMENT_H
#define I_ELEMENT_H

#include "../Comment.h"
#include "../ConfigCommon.h"

#include "IComment.h"

#include <map>
#include <vector>


//предобъявление
class Config;
class IElement;

using JPair                 = std::pair<std::string, Config>;
using shared_JPair          = std::pair<std::string, std::shared_ptr<Config>>;

using VPairElement          = std::vector<JPair>;
using shared_VPairElement   = std::vector<shared_JPair>;

using VElement              = std::vector<Config>;
using shared_VElement       = std::vector<std::shared_ptr<Config>>;

//базовый класс, в идеале используется только для ссылки на производный
class IElement : public IComment {
protected:
    ValueType m_type;
    IElement()                                                  noexcept            { m_type = ValueType::eNull; }
public:
    virtual ~IElement()                                         noexcept            {}

    // Comment =========================================================================================================
    // ========================================================================================================= Comment

    // Setters =========================================================================================================
    // ========================================================================================================= Setters

    // Getters =========================================================================================================
        // внутри у каждого потомка должна быть реализация getValue()
    // ========================================================================================================= Getters

    // Modify ==========================================================================================================
    virtual void    clear()                                     noexcept            = 0;
    // ========================================================================================================== Modify

    // Adding ==========================================================================================================
    // ========================================================================================================== Adding

    // Removing ========================================================================================================
    // ======================================================================================================== Removing

    // Info ============================================================================================================
    // ============================================================================================================ Info

    // Operators =======================================================================================================
    // ======================================================================================================= Operators

    // Iterators =======================================================================================================
    // ======================================================================================================= Iterators

    // String ==========================================================================================================
    // ========================================================================================================== String

    // File ============================================================================================================
    // ============================================================================================================ File

    // Parser ==========================================================================================================
    // ========================================================================================================== Parser

    // Info ============================================================================================================
    ValueType       getType()                                   const noexcept      { return m_type; }
    virtual bool    isContainer()                               const noexcept      { return false; }
    virtual bool    isIndexContainer()                          const noexcept      { return false; }
    virtual bool    isMapContainer()                            const noexcept      { return false; }

    bool            isCommentsEqual(const IElement& other)      const noexcept      { return m_comment == other.m_comment; }
    virtual bool    isEqual(const IElement& other, const bool compare_comments = false,
                         const bool map_sort_important = false) const noexcept      { return false; }

    //числа, контейнеры(размер), строки(длина в видимых символах)
    virtual size_t  size()                                      const noexcept      { return 0; }
    virtual bool    empty()                                     const noexcept      { return true; }
    // ============================================================================================================ Info

    // Operators =======================================================================================================
        // operator=()  не реализован для потомков
        // operator==() не реализован для потомков
        // operator!=() не реализован для потомков
        // operator>()  не реализован для потомков
        // operator>=() не реализован для потомков
        // operator<()  не реализован для потомков
        // operator<=() не реализован для потомков
    // ======================================================================================================= Operators

    // String ==========================================================================================================
    //вывод без комментариев, "tabulation_level == -1" => запись в одну строку
    //вывод без комментариев, ConfigFormat::eONLY_VALUE => запись в одну строку без комментариев
    virtual std::string toString(const ConfigFormat format = ConfigFormat::eONLY_VALUE,
                                 const CommentDesign &design = {},
                                 const int8_t custom_tabulation_level = -1)     const noexcept      = 0;
    virtual std::string toJsonString(const CommentDesign &design = {},
                                     const int8_t custom_tabulation_level = -1) const noexcept      = 0;
    virtual std::string toIniString(const CommentDesign &design = {},
                                    const int8_t custom_tabulation_level = -1)  const noexcept      = 0;
    virtual std::string toYamlString(const CommentDesign &design = {},
                                     const int8_t custom_tabulation_level = -1) const noexcept      = 0;
    virtual std::string toXmlString(const CommentDesign &design = {},
                                    const int8_t custom_tabulation_level = -1)  const noexcept      = 0;
    // NOTE: работа с std::cout реализована в Config
    // ========================================================================================================== String

    // File ============================================================================================================
        // работа с файлами и парсингом не предусмотрена для этого класса
    // ============================================================================================================ File

    // Parser ==========================================================================================================
        // работа с файлами и парсингом не предусмотрена для этого класса
    // ========================================================================================================== Parser

    // Iterators =======================================================================================================
        //индивидуально для ElementContainer классов
    // ======================================================================================================= Iterators
};

//----------------------------------------------------------------------------------------------------------------------
//TODO: добавить СЮДА Is<TYPE>(std::string) парсинги?
//----------------------------------------------------------------------------------------------------------------------


#endif // I_ELEMENT_H
