#ifndef I_ELEMENT_H
#define I_ELEMENT_H

#include "../Comment.h"
#include "../ConfigCommon.h"

#include "IComment.cpp"

#include <map>
#include <vector>


//предобъявление
class Config;
class IElement;

using JPair         = std::pair<std::string, std::shared_ptr<Config>>;
using VPairElement  = std::vector<JPair>;
using VElement      = std::vector<std::shared_ptr<Config>>;

//базовый класс, в идеале используется только для ссылки на производный
class IElement : public IComment {
protected:
    ValueType   m_type;
    IElement()                                                  noexcept            { m_type = ValueType::eNull; }
public:
    virtual ~IElement()                                         noexcept            {}

    // Setters =========================================================================================================
        // заполнение строго через конструкторы или operator=
    // ========================================================================================================= Setters

    // Getters =========================================================================================================
        // внутри у каждого потомка должна быть реализация getValue()
    // ========================================================================================================= Getters

    // Modify ==========================================================================================================
    //NOTE: не путать с remove(), здесь просто сброс комментариев, сброс значения до:
    virtual void    clear()                                     noexcept            = 0;
    // ========================================================================================================== Modify

    // Info ============================================================================================================
    ValueType       getType()                                   const noexcept      { return m_type; }
    virtual bool    isContainer()                               const noexcept      { return false; }
    virtual bool    isMapContainer()                            const noexcept      { return false; }

    bool            isEqual(const IElement& other, const bool compare_comments = false) const;

    //числа, контейнеры(размер), строки(длина в видимых символах)
    virtual size_t  size()                                      const noexcept      { return 0; }
    // ============================================================================================================ Info

    // Operators =======================================================================================================
        // operator=() не реализован для потомков
        // operator==() не реализован для потомков
        // operator!=() не реализован для потомков
        // operator>() не реализован для потомков
        // operator>=() не реализован для потомков
        // operator<() не реализован для потомков
        // operator<=() не реализован для потомков
    // ======================================================================================================= Operators

    // String ==========================================================================================================
    //вывод без комментариев, "tabulation_level == -1" => запись в одну строку
    virtual std::string toString(const ConfigFormat format = ConfigFormat::eONLY_VALUE,
                                 const int8_t tabulation_level = 0,
                                 const CommentDesign &design = {})  const noexcept  = 0;
    // NOTE: работа с std::cout реализована в Config
    // ========================================================================================================== String

    // File ============================================================================================================
        // работа с файлами и парсингом не предусмотрена для этого класса
    // ============================================================================================================ File

    // Parser ==========================================================================================================
        // работа с файлами и парсингом не предусмотрена для этого класса
    // ========================================================================================================== Parser

    // Iterators =======================================================================================================
        //индивидуально для ElementContainer классов
    // ======================================================================================================= Iterators
};

//----------------------------------------------------------------------------------------------------------------------
//TODO: добавить СЮДА Is<TYPE>(std::string) парсинги?
//----------------------------------------------------------------------------------------------------------------------

#endif // I_ELEMENT_H
